#+BEGIN_COMMENT
.. title: The Flask Debug Server
.. slug: the-flask-debug-server
.. date: 2018-05-20 13:53:54 UTC-07:00
.. tags: flask,how-to
.. category: flask
.. link: 
.. description: How to run the flask debug server.
.. type: text
#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 2
** The Development server
   This is the output of the help string for the [[http://flask.pocoo.org/docs/1.0/server/#server][development server]], note that it uses =-h= for =host= so you need to pass in =--help= to see this output or you will get an error.
#+BEGIN_SRC sh :results raw drawer
flask run --help
#+END_SRC

#+RESULTS:
:RESULTS:
Usage: flask run [OPTIONS]

  Run a local development server.

  This server is for development purposes only. It does not provide the
  stability, security, or performance of production WSGI servers.

  The reloader and debugger are enabled by default if FLASK_ENV=development
  or FLASK_DEBUG=1.

Options:
  -h, --host TEXT                 The interface to bind to.
  -p, --port INTEGER              The port to bind to.
  --cert PATH                     Specify a certificate file to use HTTPS.
  --key PATH                      The key file to use when specifying a
                                  certificate.
  --reload / --no-reload          Enable or disable the reloader. By default
                                  the reloader is active if debug is enabled.
  --debugger / --no-debugger      Enable or disable the debugger. By default
                                  the debugger is active if debug is enabled.
  --eager-loading / --lazy-loader
                                  Enable or disable eager loading. By default
                                  eager loading is enabled if the reloader is
                                  disabled.
  --with-threads / --without-threads
                                  Enable or disable multithreading.
  --help                          Show this message and exit.
:END:
